'use strict'; // Режим сучасного кода!

////////////////////////////////////
// Урок 5. Переменные и строгий режим

let number = 5; // Спосіб обявлення перемінної. Змінна перемінна 
const leftBorderWidth = 1; // Спосіб обявлення перемінної №2. Не змінна перемінна. Константа

number = 10; //
console.log(number); // Виводиться перезаписана перемінна 10

/* leftBorderWidth = 10;
console.log(leftBorderWidth); // Не виводиться і вибиває помилку.
*/

const obj = {  // Так можна міняти перемінну в (const)
    a: 50
};
obj.a = 10;
console.log(obj);

var name = 'Ivan'; // Стара перемінна. Її не використовуємо так як вона існує до того як вона обявлена в коді що суперечить логіці
// Всплытия (hoisting) переменных 
name = 'Maks'; 
console.log(name); // Виводиться перезаписана перемінна Maks

/*
{
let result = 50;
}
console.log(result); // Всі дані які віднсяться до конкретного блоку повинні бути в середині фігурних душок. Інакше їх не буде видно і це буде помилка
*/

{
    let result = 50;
    console.log(result); // Правильно і буде видно
}
    

